#include <stdio.h>

int main(void)
{
	// char 타입은 ASCII 코드와 직결됨
	// A = 65, B = 66, C = 67, ... Z = 90
	// 알파벳의 개수가 26이기 때문
	// a = 97, b = 98, c = 99, ... z = 122
	char c = '\0';

	printf("문자를 입력하세요: ");
	scanf("%c", &c);

	if (c > 96 && c < 123)
	{
		printf("소문자를 입력하셨습니다!\n");
		printf("대문자는 %c\n", c - 0x20);
	}

	if (c > 64 && c < 91)
	{
		printf("대문자를 입력하셨습니다!\n");
		printf("소문자는 %c\n", c + 0x20);
	}

	// 16진수 시스템(0x가 붙어 있다 가정함)
	// 1,  2,  3,  4,  5,  6,  7,  8,  9,  10,  11,  12,  13,  14,  15
	// 11, 12, 13, 14, 15, 16, 17, 18, 19, 110, 111, 112, 113, 114, 115
	// 1,  2,  3,  4,  5,  6,  7,  8,  9,  a,   b,   c,   d,   e,   f
	// 11, 12, 13, 14, 15, 16, 17, 18, 19, 1a,  1b,  1c,  1d,  1e,  1f

	return 0;
}
